Revit 2026 API

# EnergyDataSettingsBuildingHVACSystem Property

---

The type of HVAC system used by the building for conceptual model energy calculations.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public gbXMLBuildingHVACSystem BuildingHVACSystem { get; set; }
```
```vb
Public Property BuildingHVACSystem As gbXMLBuildingHVACSystem
	Get
	Set
```
```cpp
public:
property gbXMLBuildingHVACSystem BuildingHVACSystem {
	gbXMLBuildingHVACSystem get ();
	void set (gbXMLBuildingHVACSystem value);
}
```
```fsharp
member BuildingHVACSystem : gbXMLBuildingHVACSystem with get, set
```

#### Property Value

gbXMLBuildingHVACSystem

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The building HVAC system does not fall within an appropriate range. |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace